---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DoorFrameType
source: html/e49a843c-b164-5c73-bed8-1c2f9bf5fc4a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DoorFrameType Property

"Frame Type"

## Syntax (C#)
```csharp
public static ForgeTypeId DoorFrameType { get; }
```